onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.hw_11_2_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.hw_11_2_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.hw_11_2_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаПоставщику/ОплатаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику</name>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.hw_11_2_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаОтПокупателя/ОплатаОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаОтПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.hw_11_2_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/hw_11_2_ДоработкаФорм/Module.bsl
#Область ПрограммныйИнтерфейс

// Начало. hw_11_2.Гамберг — программное размещение полей на формах документов
Процедура ДоработатьФормуДокумента(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;

	ФормыСКонтактнымЛицом = Новый Массив;
	ФормыСКонтактнымЛицом.Добавить("Документ.ЗаказПокупателя.Форма.ФормаДокумента");
	ФормыСКонтактнымЛицом.Добавить("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
	ФормыСКонтактнымЛицом.Добавить("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента");
	ФормыСКонтактнымЛицом.Добавить("Документ.ОплатаПоставщику.Форма.ФормаДокумента");
	ФормыСКонтактнымЛицом.Добавить("Документ.ОплатаОтПокупателя.Форма.ФормаДокумента");

	Если ФормыСКонтактнымЛицом.Найти(ИмяФормы) <> Неопределено Тогда
		hw_11_2_ДобавитьПолеКонтактноеЛицо(Форма);
	КонецЕсли;

	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		hw_11_2_ДобавитьСкидкуИКнопкуЗаказПокупателя(Форма);
	КонецЕсли;

КонецПроцедуры
// Конец. hw_11_2.Гамберг

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура hw_11_2_ДобавитьПолеКонтактноеЛицо(Форма)

	Если Форма.Элементы.Найти("hw_11_2_КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЭлементДоговор = Форма.Элементы.Найти("Договор");
	Если ЭлементДоговор = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Родитель = ЭлементДоговор.Родитель;
	ПодчиненныеЭлементы = Родитель.ПодчиненныеЭлементы;
	Индекс = ПодчиненныеЭлементы.Индекс(ЭлементДоговор);
	ВставитьПеред = Неопределено;
	Если Индекс < ПодчиненныеЭлементы.Количество() - 1 Тогда
		ВставитьПеред = ПодчиненныеЭлементы.Получить(Индекс + 1);
	КонецЕсли;

	Поле = Форма.Элементы.Добавить("hw_11_2_КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
	Если ВставитьПеред <> Неопределено Тогда
		Форма.Элементы.Переместить(Поле, Родитель, ВставитьПеред);
	КонецЕсли;
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.ПутьКДанным = "Объект.КонтактноеЛицо";
	Поле.Заголовок = "Контактное лицо";

КонецПроцедуры

Процедура hw_11_2_ДобавитьСкидкуИКнопкуЗаказПокупателя(Форма)

	Если Форма.Элементы.Найти("hw_11_2_СогласованнаяСкидка") <> Неопределено
		И Форма.Элементы.Найти("hw_11_2_КнопкаПересчитатьПоСкидке") <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Якорь = Форма.Элементы.Найти("hw_11_2_КонтактноеЛицо");
	Если Якорь = Неопределено Тогда
		Якорь = Форма.Элементы.Найти("Договор");
	КонецЕсли;
	Если Якорь = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Родитель = Якорь.Родитель;
	ПодчиненныеЭлементы = Родитель.ПодчиненныеЭлементы;
	Индекс = ПодчиненныеЭлементы.Индекс(Якорь);
	ВставитьПеред = Неопределено;
	Если Индекс < ПодчиненныеЭлементы.Количество() - 1 Тогда
		ВставитьПеред = ПодчиненныеЭлементы.Получить(Индекс + 1);
	КонецЕсли;

	Если Форма.Элементы.Найти("hw_11_2_СогласованнаяСкидка") = Неопределено Тогда
		ПолеСкидки = Форма.Элементы.Добавить("hw_11_2_СогласованнаяСкидка", Тип("ПолеФормы"), Родитель);
		Если ВставитьПеред <> Неопределено Тогда
			Форма.Элементы.Переместить(ПолеСкидки, Родитель, ВставитьПеред);
		КонецЕсли;
		ПолеСкидки.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСкидки.ПутьКДанным = "Объект.СогласованнаяСкидка";
		ПолеСкидки.Заголовок = "Согласованная скидка";
		ПолеСкидки.УстановитьДействие("ПриИзменении", "hw_11_2_СогласованнаяСкидкаПриИзменении");
	КонецЕсли;

	Если Форма.Команды.Найти("hw_11_2_ПересчитатьТаблицыПоСкидке") = Неопределено Тогда
		Команда = Форма.Команды.Добавить("hw_11_2_ПересчитатьТаблицыПоСкидке");
		Команда.Действие = "hw_11_2_ПересчитатьТаблицыПоСкидке";
		Команда.Заголовок = "Пересчитать таблицы";
		Команда.ИзменяетСохраняемыеДанные = Ложь;
	КонецЕсли;

	Если Форма.Элементы.Найти("hw_11_2_КнопкаПересчитатьПоСкидке") = Неопределено Тогда
		ЯкорьСкидки = Форма.Элементы.Найти("hw_11_2_СогласованнаяСкидка");
		Если ЯкорьСкидки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		РодительКнопки = ЯкорьСкидки.Родитель;
		ПодчКнопки = РодительКнопки.ПодчиненныеЭлементы;
		ИндексК = ПодчКнопки.Индекс(ЯкорьСкидки);
		ВставитьПередК = Неопределено;
		Если ИндексК < ПодчКнопки.Количество() - 1 Тогда
			ВставитьПередК = ПодчКнопки.Получить(ИндексК + 1);
		КонецЕсли;
		Кнопка = Форма.Элементы.Добавить("hw_11_2_КнопкаПересчитатьПоСкидке", Тип("КнопкаФормы"), РодительКнопки);
		Если ВставитьПередК <> Неопределено Тогда
			Форма.Элементы.Переместить(Кнопка, РодительКнопки, ВставитьПередК);
		КонецЕсли;
		Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Кнопка.ИмяКоманды = "hw_11_2_ПересчитатьТаблицыПоСкидке";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
